In [1]:
import pandas as pd

In [3]:
# Reading the csv file
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

## 1 Math Operations

### 1.1 Operatios in columns

In [4]:
# Select a column and calculate total sum
df_exams['math score'].sum()

np.int64(66089)

###### To perform math operations on col, we have to select one first

In [10]:
# Count, mean, std, max and min function
df_exams['math score'].count()
df_exams['math score'].mean()
df_exams['math score'].std()
df_exams['math score'].max()
df_exams['math score'].min()

0

In [11]:
# Calculation with .describe()
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

### 1.2 Operations in Rows

In [12]:
# Calculating the sum in a row
df_exams['math score'] + df_exams['reading score'] + df_exams['writing score']

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [15]:
# Calculate the average and assign it to new col
df_exams['Average'] = (df_exams['math score'] + df_exams['reading score']+ df_exams['writing score'])/3

In [17]:
df_exams.head().round(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Average
0,female,group B,bachelor's degree,standard,none,72,72,74,72.67
1,female,group C,some college,standard,completed,69,90,88,82.33
2,female,group B,master's degree,standard,none,90,95,93,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.33
4,male,group C,some college,standard,none,76,78,75,76.33

## 2 Value Counts

In [19]:
# counting gender elements

# len function
len(df_exams['gender'])

# .count() method
df_exams['gender'].count()

np.int64(1000)

#### 2.1 counting elements by category

In [23]:
df_exams['lunch'].value_counts()

lunch
standard        645
free/reduced    355
Name: count, dtype: int64

In [25]:
# return the relative frequency (divide all values by the sum of values)
df_exams['gender'].value_counts(normalize = True)

gender
female    0.518
male      0.482
Name: proportion, dtype: float64

## 1. Sort a DataFrame

In [28]:
# Sort by one Column
df_exams.sort_values('lunch')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Average
999,female,group D,some college,free/reduced,none,77,86,86,83.000000
363,female,group D,some high school,free/reduced,none,27,34,32,31.000000
757,male,group E,bachelor's degree,free/reduced,completed,70,68,72,70.000000
758,female,group D,some college,free/reduced,completed,52,59,65,58.666667
760,female,group C,high school,free/reduced,none,53,72,64,63.000000
...,...,...,...,...,...,...,...,...,...
404,female,group C,high school,standard,none,54,59,62,58.333333
405,female,group C,some high school,standard,none,63,73,68,68.000000
406,male,group B,associate's degree,standard,completed,65,65,63,64.333333
409,male,group D,associate's degree,standard,completed,87,84,85,85.333333
499,male,group E,some college,standard,none,76,71,72,73.000000

In [29]:
# Sort descending by multiple columns and update dataframe
df_exams.sort_values(['math score', 'reading score', 'writing score'], ascending=False, inplace=True)

In [30]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Average
458,female,group E,bachelor's degree,standard,none,100,100,100,100.000000
916,male,group E,bachelor's degree,standard,completed,100,100,100,100.000000
962,female,group E,associate's degree,standard,none,100,100,100,100.000000
149,male,group E,associate's degree,free/reduced,completed,100,100,93,97.666667
625,male,group D,some college,standard,completed,100,97,99,98.666667
...,...,...,...,...,...,...,...,...,...
145,female,group C,some college,free/reduced,none,22,39,33,31.333333
787,female,group B,some college,standard,none,19,38,32,29.666667
17,female,group B,some high school,free/reduced,none,18,32,28,26.000000
980,female,group B,high school,free/reduced,none,8,24,23,18.333333
59,female,group C,some high school,free/reduced,none,0,17,10,9.000000